Public Attributes | List of all members
API_AssemblySegmentSchemeData Struct Reference
Element Manager
Represents a segment scheme. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_AssemblySegmentLengthTypeID  | lengthType
Segment length type.
 double  | fixedLength
Use this if lengthType is APIAssemblySegment_Fixed.
 double  | lengthProportion
Use this if lengthType is APIAssemblySegment_Proportional.
Detailed Description
Represents a segment scheme.